{
  "course_name": "Prompt Engineering: Building a Professional Portfolio - Learn Interactively",
  "course_overview": "Artificial intelligence is taking the world by storm. Machines are making decisions and automating the processes and systems. With generative AI, machines can generate text, images and audio on demand of users.\n\nIn this course, you will learn to generate a job portfolio using prompt engineering. In prompt engineering, you give the description of the task to the chatbot and it generates the required information. We ask ChatGPT to generate the cover letters, resumes, emails, and LinkedIn profiles. You will learn to modify and update the prompts to get an improved response. The portfolio is updated based on the user’s skills and the job description, matching the two. You will learn to use ChatGPT to find the right job based on your skills and experience.\n\nBy the end of the course, you will have learned to effectively write prompts. You should be able to create prompts for various tasks. The prompts can be used for other AI tools as well, and not only for text, but also for images.",
  "course_folder": "prompt engineering building a professional portfolio",
  "course_lessons": [
    "0-introduction to generative ai",
    "1-introduction to deep learning and language models",
    "2-about this course",
    "3-prompt engineering",
    "4-designing prompts",
    "5-advanced prompting concepts",
    "6-chatgpt and basic prompting",
    "7-detecting ai generated text",
    "8-the basics of cover letters",
    "9-writing cover letters with chatgpt",
    "10-cover letters for different experience levels",
    "11-cover letters for different industries and job roles",
    "12-summary cover letters",
    "13-the basics of resumes",
    "14-creating a resume with chatgpt",
    "15-updating a resume with chatgpt",
    "16-resume formatting",
    "17-case studies",
    "18-summary resumes",
    "19-a simple email",
    "20-emails for different scenarios",
    "21-responding to emails",
    "22-summary emails",
    "23-basics of a linkedin profile",
    "24-optimizing your profile",
    "25-creating a job specific profile",
    "26-summary linkedin profile",
    "27-finding jobs by interest and skills",
    "28-researching companies and job titles",
    "29-preparing for interviews",
    "30-summary job search strategies",
    "31-conclusion"
  ],
  "repo_name": "facile-scene"
}
